# PassesFilter Method (Document, ElementId) (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElementFilter..::..PassesFilter Method (Document, ElementId)
ElementFilter Class See Also
---
Applies the filter to a given element.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public bool PassesFilter(
	Document document,
	ElementId id
)
```

Visual Basic
---
```text
Public Function PassesFilter ( _
	document As Document, _
	id As ElementId _
) As Boolean
```

Visual C++
---
```text
public:
bool PassesFilter(
	Document^ document,
	ElementId^ id
)
```

# ### Parameters
document
    Type: Autodesk.Revit.DB..::..Document The document.
id
    Type: Autodesk.Revit.DB..::..ElementId The element id.
# ### Return Value
True if the element is accepted by the filter. False if the element is rejected.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ElementFilter Class
PassesFilter Overload
Autodesk.Revit.DB Namespace